import s from '../../Styles/pages/Delivery.module.sass';

const Delivery = () => {
    return (
        <section className={s.delivery}>
            <h2 className={s.deliveryHeader}>Доставка</h2>
            <span>
                Какие условия доставки курьером Rozetka?
                Вы можете заказать доставку курьером в Росетке. Услуга доступна только в некоторых городах и областях. Информация о возможности доставки курьером Rozetka указана на странице товара (не забудьте указать населенный пункт) или в блоке доставки при подтверждении заказа на сайте.

                * Убедитесь, что в указанное время получатель заказа сможет ответить на звонок курьера. В случае отсутствия связи заказ будет возвращен на склад.

                Стоимость курьерской доставки – от 98 до 303 грн в зависимости от населенного пункта.

                Точная стоимость доставки рассчитывается при оформлении заказа. Будьте внимательны и корректно указывайте город доставки.

                При доставке заказа курьером Rozetka у вас есть возможность оплатить заказ наличными или платежной картой. Оплата картой при получении имеет определенные ограничения.

                Стоимость подъема к двери рассчитывается автоматически при подтверждении заказа и зависит от размера, веса, этажа и наличия лифта. Обратите внимание, товары, которые весят от 100кг – не поднимаются.
                * Курьер заносит товар в офисные здания только при наличии места для парковки автомобиля и в сопровождении получателя.

                * Работники компании не заносят товары: в торговые и развлекательные центры, больницы, общежития, учебные заведения, на рынки, станции общественного транспорта (метро, ​​остановки, аэропорты, вокзалы).

                Какие условия доставки курьером Новой Почты?
                Условия доставки
                Срок доставки: 3-5 дней.
                Когда заказ поступит в ваш населенный пункт, с вами свяжется работник Новой почты для согласования срока доставки.
                Оплата пластиковым подарочным сертификатом недоступна. Есть возможность использования электронного подарочного сертификата.
                Максимальная сумма оплаты наличными – 49 999грн.
                Алкогольные напитки доставляются только по предоплате: безналичным расчетом или картой, GPay, ApplePay, PrivatPay
                Подъем на этаж
                Подъем габаритных грузов оплачивается отдельно.
                Необходимость предоставления услуги и ее расчетная стоимость указывает магазин при оформлении заказа.

                Какие условия доставки домой из Meest Express?
                Условия доставки
                Срок доставки – до 5 рабочих дней.
                Когда заказ поступит в ваш населенный пункт, с вами свяжется сотрудник Meest Express для согласования срока доставки.
                Доступна оплата подарочным сертификатом. Есть возможность использования электронного подарочного сертификата.
                Максимальная сумма оплаты наличными – 49 999 грн.
                Алкогольные напитки доставляются только по предоплате: безналичным расчетом или картой, GPay, ApplePay, PrivatPay
                Подъем на этаж
                Для грузов весом 30-100 кг действует дополнительная оплата из расчета 30-200 грн/этаж.
                В зависимости от веса и габаритов товара сложности подъема. Необходимость предоставления услуги указывает магазин при оформлении заказа.
            </span>
        </section>
    )
}

export default Delivery;