import getPersonalKey from "../Components/Templates/KeyGenerator/KeyGenerator";
import sink from "../Image/hits/image 1.png";
import bathroom from "../Image/hits/image 2.png";
import shower from "../Image/hits/image 3.png";
import toilet from "../Image/hits/image 4.png";
import heatedTowelRail from "../Image/hits/image 5.png";
import mixer from "../Image/stock/1 img.png";
import showerCabin from "../Image/stock/image 2.png";
import bathroomAcr from "../Image/stock/image 3.png";
import toilet2 from "../Image/stock/image 4.png";
import sink2 from "../Image/stock/image 5.png";
import article1 from '../Image/article/image 12.png'
import article2 from '../Image/article/image 13.png'
import article3 from '../Image/article/image 14.png'
import article4 from '../Image/article/image 15.png'

export const articleText = [
	{
		header: "Актуальные и необычные аксессуары для ванной комнаты",
		text: 'Для ванной комнаты очень важна чистота: здесь не только полы должны сиять, но сам воздух быть пропитанным свежестью. Не позволяйте влаге скапливаться в помещении, проветривайте ванную комнату как можно чаще. Также, вовремя меняйте полотенца, протирайте поверхности зеркал и стекол, следите за тем, чтобы для каждой принадлежности была отведена отдельная емкость, контейнер или полка./nЗубные щетки, кисти для макияжа и расчески для волос вовсе не должны быть выставлены напоказ. Прежде всего потому, что так ванная выглядит захламленной и неаккуратной, но, кроме того, во влажном воздухе очень быстро распространяются микробы, которые и оседают на всех этих предметах./nВатные диски и шарики, ушные палочки, спонжи для косметики, салфетки и прочее также рекомендуем складывать в специальные емкости. Они, к слову, могут быть стеклянными, керамическими или вытесанными из камня, и иметь привлекательный, а подчас, очень декоративный вид./nКоврик, постеленный на пол ванной комнаты, сразу делает ее похожей на жилую комнату, привнося уют и тепло. Лучше выбирать коврики из смесовых волокон, например, из хлопка и полиэстера, тогда они будут радовать вас своим качеством, мягкостью и отличным внешним видом./nПопробуйте постелить на пол сразу два или три небольших коврика, располагая их один поверх другого, или соединить изделиями торцами. Так, вы сможете комбинировать формы, фактуры или цвета ковриков.'
	},
	{
		header: 'Какой температуры должна быть горячая вода?',
		text: 'Горячая вода — такая же неотъемлемая часть нашего комфорта, как электричество, газ, отопление. По уровню потребностей ее можно поставить в один ряд с утолением голода и жажды./nЕсли температура горячей воды на момент забора составляла всего 40 градусов, то оплата за ее расход должна быть произведена по тарифу для холодной воды. Для того чтобы перерасчет мог быть произведен, необходимо сделать замеры температуры воды./nДля начала стоит обратиться в диспетчерскую службу управляющей компании или ЖКХ. Обязательна фиксация заявки о температуре воды ниже положенной в письменной форме, с указанием номера заявки, времени ее принятия и фамилии диспетчера. Возможно, спад температурного режима воды произошел вследствие технической неисправности трубопровода или по какой-либо еще известной причине. В этом случае диспетчер обязан уведомить об аварийном режиме и сроках устранения неисправности./nЕсли же температура поданной горячей воды снижена по неизвестным причинам, необходимо согласовать день и час проведения замеров. Далее после проведения замеров составляется акт. Количество экземпляров данного документа должно быть равно количеству участников процедуры. На основании проведенных измерений происходит или не происходит перерасчет оплаты горячей воды по тарификации холодной./nХотелось бы разобраться, почему нормы горячей воды для жилого дома 60 — 75 градусов? При разработке норм температурной подачи горячей воды основными моментами считаются размножение бактерий и вероятность получения ожогов. То есть температурный разбег должен быть таким, чтобы вредоносные бактерии погибали, но вместе с тем, чтобы потребляемая вода не приводила к ожоговым травмам. Последнее очень актуально для детских или лечебных учреждений./nКазалось бы, вывод очевиден: стоит подавать горячую воду с высокой температурой нагрева. Но тут существует обратная сторона. Если температура воды в кране более 50 градусов, есть вероятность получить ожог. Температура воды более 65 °C — ожог кожи за 2 секунды, температура 65 °C — ожог эпидермиса за 5 секунд, температура воды 55 °C — ожог кожи за 90 секунд./nТаким образом, температура в резервных хранилищах для нагревания и подачи горячей воды обязана быть очень высокой. Но ее использование возможно только вместе с одновременной подачей холодной воды.'
	},
	{
		header: 'Конденсат на бачке унитаза: причины появления и способы устранения',
		text: 'Одним из досадных сюрпризов в туалете и в совмещенном санузле может стать появление конденсата на бачке унитаза. Согласитесь, это не просто мелкая неприятность – это настоящая проблема, которая не только понижает уровень комфорта, но и способна негативно сказаться на здоровье всех членов семьи./nДа и любой ремонт, выполненный самыми качественными материалами, потерпит поражение в борьбе с последствиями, возникшими после длительного воздействия конденсата./nВсем известно, что предупредить проблему гораздо проще, чем потом с ней бороться. А сделать это можно своими силами, не прибегая к услугам специалистов. Для этого необходимо понять, почему появляется конденсат на бачке унитаза, и как устранить первопричину его образования./nКонденсат, появляющийся на бачке, относится к разряду бытовых проблем. Чтобы научиться эффективно с ним бороться, предстоит разобраться с причинами его появления в конкретном помещении./nЛишь после этого можно будет подобрать самый оптимальный вариант для борьбы с ним./nПрежде всего нужно понять природу возникновения «осадков» на сливном бачке. Конденсат – это капли воды, выпадающие из воздуха. Они образуются от резкого перепада температур и выступают на поверхности предметов./nКонденсат на сливном бачке – это вода, образовавшаяся от воздействия холодной воды температурой 7-15°С на внутренние стенки фаянсовой емкости и теплого воздуха температурой 25-32°С, воздействующего снаружи./nКонденсат, обнаруженный на бачке унитаза, никак не радует – хозяева квартиры/дома сразу же пытаются избавиться от него всеми возможными методами. В ход идут полотенца, баночки, блюдца и прочие предметы, которым не место рядом с унитазом. Однако образование «росы» на бачке гораздо проще предотвратить, чем постоянно собирать и убирать./n'
	},
	{
		header: 'Анаэробный герметик для резьбовых соединений',
		text: 'Герметик резьбовой предназначен для изоляции различных трубных и метрических резьбовых соединений. Это сравнительно молодой вид материалов, но, тем не менее, уже успешно вытесняет с рынка традиционные уплотнители: лен, фум-лента и т.д./nЧто такое резьбовой герметик? Какие у него особенности? Где применяется материал? Разберемся ниже./nРезьбовые герметики – это особый класс соединений. Их различают по прочности и степени вязкости. Первоначально их разрабатывали для герметизации и фиксации различных соединений в космической, машиностроительной и авиационной отрасли. Сегодня такие материалы применяются практически повсеместно: от бытового монтажа различных труб и отопительных систем до производства сложных электронных компонентов./nНезатвердевающие составы – это густые и вязкие пасты, которые состоят из синтетических смол и полимеров. Они обеспечивают качественную герметизацию различных соединений и отличаются отличной устойчивостью к вибрациям. Подобные материалы чаще всего применяются совместно с другими видами уплотнителей. Незатвердевающие составы нельзя использовать при высоком давлении в системах, так как их попросту выдавит из резьбы./nТакже многие герметики обладают слабой химостойкостью, поэтому их не следует применять в местах, где есть контакт с агрессивными средами./nК затвердевающим составам относятся герметики. Они не только уплотняют соединения, но и надежно их фиксируют. Время отверждения у каждого материала разное – одни полимеризуются за несколько минут, другие – за несколько часов, третьим нужно около суток или больше. Это зависит от многих факторов, поэтому производитель обычно указывает, сколько герметику нужно времени на отверждение. Следует помнить, что при низких температурах время полимеризации значительно увеличивается./nКлеи-герметики отлично подходят для применения в системах с высоким давлениям. После отверждения они обладают очень высокой устойчивостью к выдавливанию. К недостаткам таких материалов относят усадку в процессе высыхания. Из-за этого соединения приходится дополнительно подтягивать. Из минусов можно также выделить невозможность разборки соединения без разрушения слоя герметика. После демонтажа его нужно будет удалить и нанести заново.'
	},
]

export const articleList = [
    [
        article1, "Актуальные и необычные аксессуары для ванной комнаты", articleText[0].text
    ],
    [
        article2, "Какой температуры должна быть горячая вода?", articleText[1].text
    ],
    [
        article3, "Конденсат на бачке унитаза: причины появления и способы устранения", articleText[2].text
    ],
    [
        article4, "Анаэробный герметик для резьбовых соединений", articleText[3].text
    ],
    [
        article1, "Актуальные и необычные аксессуары для ванной комнаты", articleText[0].text
    ],
    [
        article2, "Какой температуры должна быть горячая вода?", articleText[1].text
    ],
    [
        article3, "Конденсат на бачке унитаза: причины появления и способы устранения", articleText[2].text
    ],
    [
        article4, "Анаэробный герметик для резьбовых соединений", articleText[3].text
    ],
    [
        article3, "Конденсат на бачке унитаза: причины появления и способы устранения", articleText[2].text
    ],
    [
        article4, "Анаэробный герметик для резьбовых соединений", articleText[3].text
    ],
];

export const hitsSlideItems = [
	{
		tags: ["Хит"],
		imgSrc: sink,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description: "Раковина Roca Debba 32799400Y, 60x48 см",
		country: "Испания",
		price: [2601],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Хит", "Акция"],
		imgSrc: bathroom,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 2,
		description: "Акриловая ванна AM.PM Bliss L 180х80 W53A-180-080W-ARB",
		country: "Германия",
		price: [26990, 28601],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Хит"],
		imgSrc: shower,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 24,
		description: "Душевая система Raiber R0808, хром",
		country: "Германия",
		price: [12207],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Хит"],
		imgSrc: toilet,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 4,
		description:
			"Унитаз AM.PM Spirit V2.0 C708607SC компакт с сиденьем микролифт",
		country: "Испания",
		price: [14764],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Хит"],
		imgSrc: heatedTowelRail,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 10,
		description:
			"Полотенцесушитель электрический Laris Кватро П7 40 x 60 см, 85 Вт, со...",
		country: "Россия, Украина",
		price: [12730],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Хит"],
		imgSrc: sink,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description: "Раковина Roca Debba 32799400Y, 60x48 см",
		country: "Испания",
		price: [2601],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Хит", "Акция"],
		imgSrc: bathroom,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 2,
		description: "Акриловая ванна AM.PM Bliss L 180х80 W53A-180-080W-ARB",
		country: "Германия",
		price: [26990, 28601],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Хит"],
		imgSrc: shower,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 24,
		description: "Душевая система Raiber R0808, хром",
		country: "Германия",
		price: [12207],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Хит"],
		imgSrc: toilet,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 4,
		description:
			"Унитаз AM.PM Spirit V2.0 C708607SC компакт с сиденьем микролифт",
		country: "Испания",
		price: [14764],
		personalKey: getPersonalKey(),
	},
];

export const stockSlideItems = [
	{
		tags: ["Акция"],
		imgSrc: mixer,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description: "Смеситель Hansgrohe Logis 71070000 для раковины",
		country: "Испания",
		price: [6050, 7601],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Акция"],
		imgSrc: showerCabin,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description: "Душевая кабина Black&White Galaxy G8800, 80 x 110 см",
		country: "Германия",
		price: [84000, 90580],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Акция"],
		imgSrc: bathroomAcr,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description:
			"Ванна акриловая Am.Pm Spirit W72A-160L100W-A2, 160 x 100 см, левосторонняя",
		country: "Германия",
		price: [29990, 36900],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Акция"],
		imgSrc: toilet2,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description: "Унитаз Laguraty 8074 крышка микролифт, с функцией биде",
		country: "Испания",
		price: [32108, 34900],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Акция"],
		imgSrc: sink2,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 10,
		description: "Раковина Laufen Palace 120 см 8.1170.4.000.104.1",
		country: "Швейцария",
		price: [53458, 58601],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Акция"],
		imgSrc: mixer,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description: "Смеситель Hansgrohe Logis 71070000 для раковины",
		country: "Испания",
		price: [6050, 7601],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Акция"],
		imgSrc: showerCabin,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description: "Душевая кабина Black&White Galaxy G8800, 80 x 110 см",
		country: "Германия",
		price: [84000, 90580],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Акция"],
		imgSrc: bathroomAcr,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description:
			"Ванна акриловая Am.Pm Spirit W72A-160L100W-A2, 160 x 100 см, левосторонняя",
		country: "Германия",
		price: [29990, 36900],
		personalKey: getPersonalKey(),
	},
	{
		tags: ["Акция"],
		imgSrc: toilet2,
		stars: ["full", "full", "full", "full", "half"],
		reviews: 12,
		description: "Унитаз Laguraty 8074 крышка микролифт, с функцией биде",
		country: "Испания",
		price: [32108, 34900],
		personalKey: getPersonalKey(),
	},
];

export const hitsMenu = [
	"Любые товары",
	"Раковины",
	"Ванны",
	"Унитазы",
	"Душевые системы",
	"Смесители",
	"Зеркала",
	"Душевые кабины",
	"Стиральные машины",
];

export const stockMenu = [
	"Любые товары",
	"Смесители",
	"Полотенцесушители",
	"Биде",
	"Душевые системы",
	"Ванны",
	"Унитазы",
	"Отопители",
	"Посудомоечные машины",
];
